modules/ome-lisp.org
#+TITLE: Oh My Emacs Lisps
#+OPTIONS: toc:2 num:nil ^:nil

This is part of the [[https://github.com/xiaohanyu/oh-my-emacs][oh-my-emacs]].

This file contains some settings for lisp dialects including [[* Emacs Lisp][Emacs Lisp]], [[* Scheme][Scheme]], [[* Common Lisp][Common Lisp]], and [[* Clojure][Clojure]].

* Prerequisites
  :PROPERTIES:
  :CUSTOM_ID: lisp-prerequisites
  :END:

#+NAME: lisp-prerequisites
#+CAPTION: Prerequisites for ome-lisp module
|            | Windows | Ubuntu/Debian/Mint | ArchLinux | Fedora | Mac OS X | Mandatory? |
|------------+---------+--------------------+-----------+--------+----------+------------|
| [[http://www.sbcl.org/][SBCL]]       |         | sbcl               |           |        |          | Yes        |
| [[http://ccl.clozure.com/][Clozure CL]] |         | [web]              |           |        |          | No         |
| [[http://www.clisp.org/][CLISP]]      |         | clisp              |           |        |          | No         |
| [[http://www.gnu.org/software/guile/][Guile]]      |         | guile-2.0          |           |        |          | Yes        |
| [[http://racket-lang.org/][Racket]]     |         | racket             |           |        |          | No         |
| [[http://leiningen.org/][Leiningen]]  | [web]   | [web]              | [web]     | [web]  | [web]    | Yes        |

Note:
- [[http://www.sbcl.org/][SBCL]] or [[http://ccl.clozure.com/][Clozure CL]] or [[http://www.clisp.org/][CLISP]] as a Common Lisp implementation. I recommend
  SBCL since it has good performance, and is easy to install via package
  manager.
- [[http://www.gnu.org/software/guile/][Guile]] or [[http://racket-lang.org/][Racket]] as a Scheme implementation. Geiser requires Guile >= 2.0.
- [[http://leiningen.org/][Leiningen]] for Clojure. I recommend you install leiningen from the official
  website to keep update with the lastest version.

* El-get packages
  :PROPERTIES:
  :CUSTOM_ID: lisp-el-get-packages
  :END:

#+NAME: gui-el-get-packages
#+CAPTION: El-get packages for ome-lisp module
|                 | Status   | Description                                    |
|-----------------+----------+------------------------------------------------|
| [[https://github.com/purcell/elisp-slime-nav][elisp-slime-nav]] | Required | Shortcuts for browsing elisp code.             |
| [[http://common-lisp.net/project/slime/][slime]]           | Required | One of the most amazing package for Emacs.     |
| [[https://github.com/purcell/ac-slime][ac-slime]]        | Required | AC backend for slime.                          |
| [[https://github.com/clojure-emacs/clojure-mode][clojure-mode]]    | Required | Major mode for Clojure.                        |
| [[https://github.com/clojure-emacs/nrepl.el][nrepl.el]]        | Required | Nrepl to Clojure is what slime to Common Lisp. |
| [[https://github.com/purcell/ac-nrepl.git][ac-nrepl]]        | Required | AC backend for nrepl.                          |
| [[http://www.nongnu.org/geiser/][geiser]]          | Required | Geiser to Scheme is what slime to Common Lisp. |

* Basics
  :PROPERTIES:
  :CUSTOM_ID: basic-lisp
  :END:

This section contains some basic settings which is common to all lisp modes.

#+NAME: basic-lisp
#+BEGIN_SRC emacs-lisp
  (defvar ome-lisp-modes '(emacs-lisp-mode
                           inferior-emacs-lisp-mode
                           lisp-interaction-mode
                           scheme-mode
                           lisp-mode
                           eshell-mode
                           slime-repl-mode
                           nrepl-mode
                           clojure-mode
                           common-lisp-mode)
    "List of Lisp modes.")
#+END_SRC

* Emacs Lisp
  :PROPERTIES:
  :CUSTOM_ID: emacs-lisp
  :END:

Emacs is really a great "IDE" for developing Elisp programs. This section
contains some goodies for elisp development.

[[https://github.com/purcell/elisp-slime-nav][elisp-slime-nav]] provide some slime-like shortcuts to find function/variable
definitions, which is useful when you want to know the details, as you know,
there's no secret with source code. But the default shortcuts for
=elisp-slime-nav-find-elisp-thing-at-point= has conflicts with =evil-mode=,
which is enabled by default by oh-my-emacs, I still didn't figure out a good
way to solve this, so any help will be appreciated.

#+NAME: emacs-lisp
#+BEGIN_SRC emacs-lisp
  (defun ome-remove-elc-on-save ()
    "If you're saving an elisp file, likely the .elc is no longer valid."
    (make-local-variable 'after-save-hook)
    (add-hook 'after-save-hook
              (lambda ()
                (if (file-exists-p (concat buffer-file-name "c"))
                    (delete-file (concat buffer-file-name "c"))))))

  (add-hook 'emacs-lisp-mode-hook 'ome-remove-elc-on-save)
  (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)

  (defun ome-elisp-slime-nav-setup ()
    ;; (defun ome-elisp-slime-nav-keybindings-in-evil ()
    ;;   (if (and (boundp 'evil-mode) evil-mode)
    ;;       (progn (define-key elisp-slime-nav-mode-map (kbd "C-c C-d .")
    ;;                'elisp-slime-nav-find-elisp-thing-at-point)
    ;;              (define-key elisp-slime-nav-mode-map (kbd "C-c C-d ,")
    ;;                'pop-tag-mark))))
    (dolist (hook '(emacs-lisp-mode-hook
                    lisp-interaction-mode-hook
                    ielm-mode-hook
                    eshell-mode-hook))
      (add-hook hook 'turn-on-elisp-slime-nav-mode)))
      ;; (add-hook hook 'ome-elisp-slime-nav-keybindings-in-evil)))

  (add-to-list 'el-get-sources
               '(:name elisp-slime-nav
                       :after (progn
                                (ome-elisp-slime-nav-setup))))
#+END_SRC

** IELM
   :PROPERTIES:
   :CUSTOM_ID: ielm
   :END:

[[http://www.emacswiki.org/emacs/InferiorEmacsLispMode][IELM]] is an alternative to Lisp Interactive mode, you can treat IELM as [[http://emacs-fu.blogspot.com/2011/03/ielm-repl-for-emacs.html][a REPL
for emacs]]. Though convenient, IELM lacks some import features to be a real
REPL, such as =python-shell-send-defun= in Emacs 24.3 builtin python mode.

#+NAME: emacs-lisp
#+BEGIN_SRC emacs-lisp
  (defun ome-visit-ielm ()
    "Switch to default `ielm' buffer.
  Start `ielm' if it's not already running."
    (interactive)
    (ome-start-or-switch-to 'ielm "*ielm*"))

  (define-key emacs-lisp-mode-map (kbd "C-c C-z") 'ome-visit-ielm)
  (add-to-list 'ac-modes 'inferior-emacs-lisp-mode)
  (add-hook 'ielm-mode-hook 'ac-emacs-lisp-mode-setup)
  (add-hook 'ielm-mode-hook 'turn-on-eldoc-mode)
#+END_SRC

