ome-lisp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Lisps</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Lisps"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-13T22:22+0800"/>
<meta name="author" content="Xiao Hanyu"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="emacs.css" type="text/css"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Lisps</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>
<p>
This file contains some settings for lisp dialects including <a href="#sec-3">Emacs Lisp</a>, <a href="#sec-6">Scheme</a>, <a href="#sec-4">Common Lisp</a>, and <a href="#sec-5">Clojure</a>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Prerequisites</a>
<ul>
<li><a href="#sec-1-1">Mandatory</a></li>
</ul>
</li>
<li><a href="#basic-lisp">Basics</a></li>
<li><a href="#emacs-lisp">Emacs Lisp</a>
<ul>
<li><a href="#ielm">IELM</a></li>
<li><a href="#eshell">Eshell</a></li>
</ul>
</li>
<li><a href="#common-lisp">Common Lisp</a></li>
<li><a href="#clojure">Clojure</a></li>
<li><a href="#scheme">Scheme</a></li>
<li><a href="#sec-7">Todos</a>
<ul>
<li><a href="#sec-7-1">Elisp</a></li>
<li><a href="#sec-7-2">Common Lisp</a></li>
<li><a href="#sec-7-3">Scheme</a></li>
<li><a href="#sec-7-4">Clojure</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Prerequisites</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Mandatory</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li><a href="http://www.sbcl.org/">SBCL</a> or <a href="http://ccl.clozure.com/">Clozure CL</a> or <a href="http://www.clisp.org/">CLISP</a> as a Common Lisp implementation.
</li>
<li><a href="http://www.gnu.org/software/guile/">Guile</a> or <a href="http://racket-lang.org/">Racket</a> as a Scheme implementation.
</li>
<li><a href="http://leiningen.org/">Leiningen</a> for Clojure
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-basic-lisp" class="outline-2">
<h2 id="basic-lisp"><a name="sec-2" id="sec-2"></a>Basics</h2>
<div class="outline-text-2" id="text-basic-lisp">


<p>
This section contains some basic settings which is common to all lisp modes.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">ome-lisp-modes</span> '(emacs-lisp-mode
                         inferior-emacs-lisp-mode
                         lisp-interaction-mode
                         scheme-mode
                         lisp-mode
                         eshell-mode
                         slime-repl-mode
                         nrepl-mode
                         clojure-mode
                         common-lisp-mode)
  <span class="org-doc">"List of Lisp modes."</span>)
</pre>


</div>

</div>

<div id="outline-container-emacs-lisp" class="outline-2">
<h2 id="emacs-lisp"><a name="sec-3" id="sec-3"></a>Emacs Lisp</h2>
<div class="outline-text-2" id="text-emacs-lisp">


<p>
Emacs is really a great "IDE" for developing Elisp programs. This section
contains some goodies for elisp development.
</p>
<p>
<a href="https://github.com/purcell/elisp-slime-nav">elisp-slime-nav</a> provide some slime-like shortcuts to find function/variable
definitions, which is useful when you want to know the details, as you know,
there's no secret with source code. But the default shortcuts for
<code>elisp-slime-nav-find-elisp-thing-at-point</code> has conflicts with <code>evil-mode</code>,
which is enabled by default by oh-my-emacs, I still didn't figure out a good
way to solve this, so any help will be appreciated.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">ome-remove-elc-on-save</span> ()
  <span class="org-doc">"If you're saving an elisp file, likely the .elc is no longer valid."</span>
  (make-local-variable 'after-save-hook)
  (add-hook 'after-save-hook
            (<span class="org-keyword">lambda</span> ()
              (<span class="org-keyword">if</span> (file-exists-p (concat buffer-file-name <span class="org-string">"c"</span>))
                  (delete-file (concat buffer-file-name <span class="org-string">"c"</span>))))))

(add-hook 'emacs-lisp-mode-hook 'ome-remove-elc-on-save)
(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)

(<span class="org-keyword">defun</span> <span class="org-function-name">ome-elisp-slime-nav-setup</span> ()
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(defun ome-elisp-slime-nav-keybindings-in-evil ()</span>
  <span class="org-comment-delimiter">;;   </span><span class="org-comment">(if (and (boundp 'evil-mode) evil-mode)</span>
  <span class="org-comment-delimiter">;;       </span><span class="org-comment">(progn (define-key elisp-slime-nav-mode-map (kbd "C-c C-d .")</span>
  <span class="org-comment-delimiter">;;                </span><span class="org-comment">'elisp-slime-nav-find-elisp-thing-at-point)</span>
  <span class="org-comment-delimiter">;;              </span><span class="org-comment">(define-key elisp-slime-nav-mode-map (kbd "C-c C-d ,")</span>
  <span class="org-comment-delimiter">;;                </span><span class="org-comment">'pop-tag-mark))))</span>
  (<span class="org-keyword">dolist</span> (hook '(emacs-lisp-mode-hook
                  lisp-interaction-mode-hook
                  ielm-mode-hook
                  eshell-mode-hook))
    (add-hook hook 'turn-on-elisp-slime-nav-mode)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook hook 'ome-elisp-slime-nav-keybindings-in-evil)))</span>

(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> elisp-slime-nav
                     <span class="org-builtin">:after</span> (<span class="org-keyword">progn</span>
                              (ome-elisp-slime-nav-setup))))
</pre>



</div>

<div id="outline-container-ielm" class="outline-3">
<h3 id="ielm"><a name="sec-3-1" id="sec-3-1"></a>IELM</h3>
<div class="outline-text-3" id="text-ielm">


<p>
<a href="http://www.emacswiki.org/emacs/InferiorEmacsLispMode">IELM</a> is an alternative to Lisp Interactive mode, you can treat IELM as <a href="http://emacs-fu.blogspot.com/2011/03/ielm-repl-for-emacs.html">a REPL for emacs</a>. Though convenient, IELM lacks some import features to be a real
REPL, such as <code>python-shell-send-defun</code> in Emacs 24.3 builtin python mode.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">ome-visit-ielm</span> ()
  <span class="org-doc">"Switch to default `</span><span class="org-doc"><span class="org-constant">ielm</span></span><span class="org-doc">' buffer.</span>
<span class="org-doc">Start `</span><span class="org-doc"><span class="org-constant">ielm</span></span><span class="org-doc">' if it's not already running."</span>
  (interactive)
  (ome-start-or-switch-to 'ielm <span class="org-string">"*ielm*"</span>))

(define-key emacs-lisp-mode-map (kbd <span class="org-string">"C-c C-z"</span>) 'ome-visit-ielm)
(add-to-list 'ac-modes 'inferior-emacs-lisp-mode)
(add-hook 'ielm-mode-hook 'ac-emacs-lisp-mode-setup)
(add-hook 'ielm-mode-hook 'turn-on-eldoc-mode)
</pre>


</div>

</div>
