ome-lisp.html

<div id="outline-container-eshell" class="outline-3">
<h3 id="eshell"><a name="sec-3-2" id="sec-3-2"></a>Eshell</h3>
<div class="outline-text-3" id="text-eshell">


<p>
I think you can treat <a href="http://www.gnu.org/software/emacs/manual/html_mono/eshell.html">Eshell</a> as a combination of traditional Unix shell and
IELM. Eshell is a command shell written in Emacs Lisp, which means it's as
portable as Emacs itself. In fact, Eshell replicates most of the features and
commands from GNU CoreUtils and the Bourne-like shells, thus Eshell will
function identically on any environment Emacs itself runs on.
</p>
<p>
To your surprise, Eshell does not inherit from <code>comint-mode</code>, which means that
hooks and routines for <code>comint-mode</code> won't work for Eshell. For more details
about how to mastering eshell, see <a href="http://www.masteringemacs.org/articles/2010/12/13/complete-guide-mastering-eshell/">MASTERING ESHELL</a>.
</p>



<pre class="src src-emacs-lisp">(add-hook 'eshell-mode-hook
          (<span class="org-keyword">lambda</span> ()
            (add-to-list 'ac-sources 'ac-source-pcomplete)))

(add-to-list 'ac-modes 'eshell-mode)
(add-hook 'eshell-mode-hook 'turn-on-eldoc-mode)
(add-hook 'eshell-mode-hook 'ac-emacs-lisp-mode-setup)
</pre>

</div>
</div>

</div>

<div id="outline-container-common-lisp" class="outline-2">
<h2 id="common-lisp"><a name="sec-4" id="sec-4"></a>Common Lisp</h2>
<div class="outline-text-2" id="text-common-lisp">


<p>
<a href="http://common-lisp.net/project/slime/">SLIME</a> is the Superior Lisp Interaction Mode for Emacs, here're some <a href="http://www.cliki.net/SLIME%20Features">features</a>
and <a href="http://www.cliki.net/SLIME%20Tips">tips</a>. Believe me, SLIME in Emacs is a subversive developing environment for
Common Lisp, it is the ultimate solution for languages with a <a href="http://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop">REPL</a>. SLIME is
the bridge between an Editor(here, Emacs for example, vim users have a <a href="http://www.vim.org/scripts/script.php?script_id=2531">slimv</a>
which is a fork of SLIME to vim) and a running Common Lisp environment. It
makes your workflow so smooth and enjoyable that you will miss it so much when
working with other REPL languages such as Python/Ruby/JavaScript<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>, etc.
</p>
<p>
Some good resources about SLIME:
</p><ul>
<li><a href="http://bc.tech.coop/blog/081209.html">Understanding SLIME (Using Emacs and Lisp Cooperatively)</a>, a really concise
  explanation of SLIME's architecture, together with lots of valuable links,
  from which you will understand why SLIME is so great and amazing.
</li>
<li><a href="http://lisp-book.org/contents/chslime.pdf">Chapter 18. SLIME</a> from <a href="http://lisp-book.org/contents/chslime.pdf">Lisp Outside the Box</a> provides a really detailed guide
  to SLIME.
</li>
<li><a href="http://common-lisp.net/project/slime/doc/html/">SLIME User Manual</a> provides expert information and is your lifelong friend.
</li>
<li>For Chinese, <a href="http://www.feime.net/2013/%E6%96%B0%E5%B9%B4%E7%AC%AC%E4%B8%80%E7%AF%87-%E7%BB%99lisp%E6%96%B0%E6%89%8B%E4%BB%8B%E7%BB%8D%E4%B8%8Bslime%E8%BF%99%E4%B8%AA%E7%A5%9E%E5%99%A8/">Albertlee's Blog</a> provides a detailed overview of SLIME.
</li>
<li><a href="http://ghostopera.org/blog/2012/06/24/the-newbie-guide-to-common-lisp/">The Newbie Guide to Getting Started on Common Lisp</a> provides a concise and
  helpful guide to start programming with Common Lisp.
</li>
</ul>


<p>
To use SLIME, you must install an <a href="http://www.cliki.net/common%20lisp%20implementation">Lisp Implementation</a>, just like if you want to do
C programming, you must install a C compiler such as GCC. Here I recommend <a href="http://www.sbcl.org/">SBCL</a>
for you. You can get it by <code>sudo apt-get install sbcl</code> in Ubuntu/Mint/Debian.
</p>
<p>
<a href="http://www.lispworks.com/">LispWorks</a> provides a comprehensive documentation for Common Lisp called
<a href="http://www.lispworks.com/documentation/HyperSpec/Front/">hyperspec</a>, which integrates quite well with SLIME through
<code>slime-documentation-lookup</code>. You can get by <code>sudo apt-get install hyperspec</code>
in Ubuntu/Mint/Debian. To use hyperspec in ubuntu/mint, you can: <code>sudo apt-get install hyperspec</code>, which also set proper <code>common-lisp-hyperspec-root</code> for
you. On other Linux distributions, maybe you need to set it manually to tell
SLIME where to find the hyperspec document.
</p>
<p>
You can also get <a href="http://en.wikipedia.org/wiki/Common_Lisp_the_Language">CLTL</a> by <code>sudo apt-get install cltl</code>, which is the defacto
standard for Common Lisp before the ANSI standard.
</p>
<p>
Oh-my-emacs also configure <a href="http://emacs-w3m.namazu.org/">emacs-w3m</a> as the default documentation browser for
SLIME.
</p>
<p>
Oh-my-emacs integrates <a href="https://github.com/purcell/ac-slime">ac-slime</a> for instant in-buffer completion, and should be
self-adapted to your system, by which I mean, it will use an available lisp
implementation by finding it using <code>executable-find</code> instead of specifying a
fixed file path like <code>/usr/bin/sbcl</code>.
</p>
<p>
Enough stuff, enjoy your Common Lisp journey with Emacs and SLIME.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">ome-common-lisp-slime-setup</span> ()
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Define multiple lisp backends</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">see http://nklein.com/2010/05/getting-started-with-clojureemacsslime/</span>
  (<span class="org-keyword">defmacro</span> <span class="org-function-name">defslime-start</span> (name mapping)
    `(<span class="org-keyword">defun</span> ,name ()
       (interactive)
       (<span class="org-keyword">let</span> ((slime-default-lisp ,mapping))
         (slime))))
  (setq slime-lisp-implementations
        `((sbcl (,(executable-find <span class="org-string">"sbcl"</span>)) <span class="org-builtin">:coding-system</span> utf-8-unix)
          (ccl (,(executable-find <span class="org-string">"ccl"</span>)))
          (ccl64 (,(executable-find <span class="org-string">"ccl64"</span>)))
          (clisp (,(executable-find <span class="org-string">"clisp"</span>)))))

  (defslime-start slime-sbcl 'sbcl)
  (defslime-start slime-ccl 'ccl)
  (defslime-start slime-ccl64 'ccl64)
  (defslime-start slime-clisp 'clisp)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">If you use ubuntu/mint, then "sudo apt-get install hyperspec" will set</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">this for you in a file like "/etc/emacs/site-start.d/60hyperspec.el"</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq common-lisp-hyperspec-root "/usr/share/doc/hyperspec/")</span>

  (global-set-key (kbd <span class="org-string">"C-c s"</span>) 'slime-selector)
  (setq slime-net-coding-system 'utf-8-unix)
  (setq slime-complete-symbol*-fancy t)
  (setq slime-complete-symbol-function 'slime-fuzzy-complete-symbol)
  (setq inferior-lisp-program
        (or (executable-find <span class="org-string">"sbcl"</span>)
            (executable-find <span class="org-string">"ccl"</span>)
            (executable-find <span class="org-string">"ccl64"</span>)
            (executable-find <span class="org-string">"clisp"</span>)))
  (slime-setup '(slime-fancy
                 slime-indentation
                 slime-banner
                 slime-highlight-edits)))

(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> slime
                     <span class="org-builtin">:after</span> (<span class="org-keyword">progn</span>
                              (ome-common-lisp-slime-setup))))

(<span class="org-keyword">defun</span> <span class="org-function-name">ome-ac-slime-setup</span> ()
  (add-hook 'slime-mode-hook
            (<span class="org-keyword">lambda</span> ()
              (set-up-slime-ac t)))     <span class="org-comment-delimiter">; </span><span class="org-comment">use slime-fuzzy-complete-symbol</span>
  (add-hook 'slime-repl-mode-hook
            (<span class="org-keyword">lambda</span> ()
              (set-up-slime-ac t)))
  (<span class="org-keyword">eval-after-load</span> <span class="org-string">"auto-complete"</span>
    '(add-to-list 'ac-modes 'slime-repl-mode)))

(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> ac-slime
                     <span class="org-builtin">:after</span> (<span class="org-keyword">progn</span>
                              (ome-ac-slime-setup))))

</pre>


</div>

</div>
