modules/ome-lisp.org
* Clojure
  :PROPERTIES:
  :CUSTOM_ID: clojure
  :END:

[[http://www.clojure.org][Clojure]] is a modern Lisp on top of JVM, it is a member of the Lisp family of
languages. Clojure extends the code-as-data system beyond parenthesized lists
(s-expressions) to vectors and maps.

Since Clojure is a Lisp dialect, it should work the SLIME way. Yeah, first
comes [[https://github.com/technomancy/swank-clojure][swank-clojure]], then [[https://github.com/clojure-emacs/nrepl.el][nrepl.el]]. The only thing you need to install is
[[http://leiningen.org/][leiningen]] 2.x. I recommend you to install it manually, since not all [[https://github.com/technomancy/leiningen/wiki/Packaging][package
manager]] provides the latest version.

The general way to install lastest stable leiningen is:
#+BEGIN_SRC sh
wget -O /tmp/lein https://raw.github.com/technomancy/leiningen/stable/bin/lein
sudo mv /tmp/lein /usr/bin/lein
lein version
#+END_SRC

Or you can see leiningen's [[https://github.com/technomancy/leiningen/wiki/Upgrading][wiki]] for upgrading details.

Now, just open a clojure file, then =nrepl-jack-in=, and you can program
Clojure the SLIME way. [[http://vimeo.com/22798433][Here]] is an awesome live demo to demonstrate the Clojure
workflow.

It's really really awesome, ah?

#+NAME: clojure
#+BEGIN_SRC emacs-lisp
  (add-to-list 'el-get-sources
               '(:name clojure-mode))

  (defun ome-nrepl-setup ()
    (add-hook 'nrepl-interaction-mode-hook
              'nrepl-turn-on-eldoc-mode)
    (setq nrepl-hide-special-buffers t)
    (setq nrepl-buffer-name-separator "-")
    (setq nrepl-buffer-name-show-port t))

  (add-to-list 'el-get-sources
               '(:name nrepl
                       :after (progn
                                (ome-nrepl-setup))))

  (defun ome-ac-nrepl-setup ()
    (add-hook 'nrepl-mode-hook 'ac-nrepl-setup)
    (add-hook 'nrepl-interaction-mode-hook 'ac-nrepl-setup)
    (eval-after-load "auto-complete"
      '(add-to-list 'ac-modes 'nrepl-mode)))

  (add-to-list 'el-get-sources
               '(:name ac-nrepl
                       :after (progn
                                (ome-ac-nrepl-setup))))
#+END_SRC

* Scheme
  :PROPERTIES:
  :CUSTOM_ID: scheme
  :END:

[[http://en.wikipedia.org/wiki/Scheme_(programming_language)][Scheme]] is my favourite programming language, it is small, elegant and
powerful. Unfortunately, there're too many choices for scheme implementation,
which makes it a headache when you want to do some real world job with scheme.

Oh-my-emacs adopts [[http://www.nongnu.org/geiser/][geiser]], which provides a similar SLIME way to work with
scheme. To install geiser, you need install =automake= and =autoconf=. And to
run geiser, you need install at least one of the geiser supported scheme
implementation, namely, [[http://www.gnu.org/software/guile/][guile]] or [[http://racket-lang.org/][racket]].

There's a new experimental [[https://github.com/xiaohanyu/ac-geiser][ac-geiser]] project, written by me --- yeah, it's me,
I am the author, which provides a auto-complete backend for geiser. It is
still in beta version, however, and will be sent to el-get when stable.

#+NAME: geiser
#+BEGIN_SRC emacs-lisp
  (add-to-list 'el-get-sources
               '(:name geiser))

  (defun ome-ac-geiser-setup ()
    (add-hook 'geiser-mode-hook 'ac-geiser-setup)
    (add-hook 'geiser-repl-mode-hook 'ac-geiser-setup)
    (eval-after-load "auto-complete"
      '(add-to-list 'ac-modes 'geiser-repl-mode)))

  (add-to-list 'el-get-sources
               '(:name ac-geiser
                       :after (progn
                                (ome-ac-geiser-setup))))

  ;; (add-to-list 'el-get-sources
  ;;              '(:name quack))
#+END_SRC

Actually, the official SLIME contrib has some swank backends for scheme
implementations, you can try it if you like. There's a [[https://github.com/nickg/swank-chicken][swank-chicken]] for
[[http://www.call-cc.org/][chicken scheme]], but it only provides a small part of SLIME features. So it is
disabled by default.

#+NAME: chicken
#+BEGIN_SRC emacs-lisp :tangle no
  (defun ome-swank-chicken-setup ()
    (setq swank-chicken-path "~/.emacs.d/el-get/swank-chicken/swank-chicken.scm")
    (add-hook 'scheme-mode-hook
              (lambda ()
                (slime-mode t))))

  (add-to-list 'el-get-sources
               '(:name swank-chicken
                       :after (progn
                                (ome-swank-chicken-setup))))
#+END_SRC

* Todos
** Elisp
- What is overlay?
- What is syntax?
- Learn more knowledge about emacs key-maps, and what's the difference between
  =global-set-key= and =remap=.
- Learn more knowledge about emacs syntax-table, functions like
  =modify-syntax-entry=, etc.
- What =enable-recursive-minibuffers= means to us?
- How to do asynchronous programming in emacs lisp?
- Make =ielm= as a real elisp =REPL=?

** Common Lisp
- Integrate [[http://www.foldr.org/~michaelw/emacs/redshank/][redshank]]?
- Find a method to rebase the source tree of various CL implementations, which
  is useful for =slime-edit-definition=.

** Scheme
- Write a package "ac-geisure", just like ac-slime.

** Clojure
- The boot up speed of JVM is too slow, so we may need to refer to
  http://icylisper.github.io/jark/.

* Footnotes
[1] [[https://github.com/swank-js/swank-js][swank-js]], [[http://common-lisp.net/~crhodes/swankr/][swankr]]
