ome-lisp.html

<div id="outline-container-clojure" class="outline-2">
<h2 id="clojure"><a name="sec-5" id="sec-5"></a>Clojure</h2>
<div class="outline-text-2" id="text-clojure">


<p>
<a href="http://www.clojure.org">Clojure</a> is a modern Lisp on top of JVM, it is a member of the Lisp family of
languages. Clojure extends the code-as-data system beyond parenthesized lists
(s-expressions) to vectors and maps.
</p>
<p>
Since Clojure is a Lisp dialect, it should work the SLIME way. Yeah, first
comes <a href="https://github.com/technomancy/swank-clojure">swank-clojure</a>, then <a href="https://github.com/clojure-emacs/nrepl.el">nrepl.el</a>. The only thing you need to install is
<a href="http://leiningen.org/">leiningen</a> 2.x. I recommand you to install it manually, since not all <a href="https://github.com/technomancy/leiningen/wiki/Packaging">package manager</a> provides the latest version.
</p>
<p>
The general way to install lastest stable leiningen is:
</p>


<pre class="src src-sh">wget -O /tmp/lein https://raw.github.com/technomancy/leiningen/stable/bin/lein
sudo mv /tmp/lein /usr/bin/lein
lein version
</pre>


<p>
Or you can see leiningen's <a href="https://github.com/technomancy/leiningen/wiki/Upgrading">wiki</a> for upgrading details.
</p>
<p>
Now, just open a clojure file, then <code>nrepl-jack-in</code>, and you can program
Clojure the SLIME way. <a href="http://vimeo.com/22798433">Here</a> is an awesome live demo to demostrate the Clojure
workflow.
</p>
<p>
It's really really awesome, ah?
</p>



<pre class="src src-emacs-lisp">(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> clojure-mode))

(<span class="org-keyword">defun</span> <span class="org-function-name">ome-nrepl-setup</span> ()
  (add-hook 'nrepl-interaction-mode-hook
            'nrepl-turn-on-eldoc-mode)
  (setq nrepl-hide-special-buffers t)
  (setq nrepl-buffer-name-separator <span class="org-string">"-"</span>)
  (setq nrepl-buffer-name-show-port t))

(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> nrepl
                     <span class="org-builtin">:after</span> (<span class="org-keyword">progn</span>
                              (ome-nrepl-setup))))

(<span class="org-keyword">defun</span> <span class="org-function-name">ome-ac-nrepl-setup</span> ()
  (add-hook 'nrepl-mode-hook 'ac-nrepl-setup)
  (add-hook 'nrepl-interaction-mode-hook 'ac-nrepl-setup)
  (<span class="org-keyword">eval-after-load</span> <span class="org-string">"auto-complete"</span>
    '(add-to-list 'ac-modes 'nrepl-mode)))

(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> ac-nrepl
                     <span class="org-builtin">:after</span> (<span class="org-keyword">progn</span>
                              (ome-ac-nrepl-setup))))
</pre>


</div>

</div>

<div id="outline-container-scheme" class="outline-2">
<h2 id="scheme"><a name="sec-6" id="sec-6"></a>Scheme</h2>
<div class="outline-text-2" id="text-scheme">


<p>
<a href="http://en.wikipedia.org/wiki/Scheme_(programming_language)">Scheme</a> is my favourite programming language, it is small, elegant and
powerful. Unfortunately, there're too many choices for scheme implementation,
which makes it a headache when you want to do some real world job with scheme.
</p>
<p>
Oh-my-emacs adopts <a href="http://www.nongnu.org/geiser/">geiser</a>, which provides a similar SLIME way to work with
scheme. To install geiser, you need install <code>automake</code> and <code>autoconf</code>. And to
run geiser, you need install at least one of the geiser supported scheme
implementation, namely, <a href="http://www.gnu.org/software/guile/">guile</a> or <a href="http://racket-lang.org/">racket</a>.
</p>



<pre class="src src-emacs-lisp">(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> geiser))

<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-to-list 'el-get-sources</span>
<span class="org-comment-delimiter">;;              </span><span class="org-comment">'(:name quack))</span>
</pre>


<p>
Actually, the official SLIME contrib has some swank backends for scheme
implementations, you can try it if you like. There's a <a href="https://github.com/nickg/swank-chicken">swank-chicken</a> for
<a href="http://www.call-cc.org/">chicken scheme</a>, but it only provides a small part of SLIME features. So it is
disabled by default.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">ome-swank-chicken-setup</span> ()
  (setq swank-chicken-path <span class="org-string">"~/.emacs.d/el-get/swank-chicken/swank-chicken.scm"</span>)
  (add-hook 'scheme-mode-hook
            (<span class="org-keyword">lambda</span> ()
              (slime-mode t))))

(add-to-list 'el-get-sources
             '(<span class="org-builtin">:name</span> swank-chicken
                     <span class="org-builtin">:after</span> (<span class="org-keyword">progn</span>
                              (ome-swank-chicken-setup))))
</pre>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Todos</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">Elisp</h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>What is overlay?
</li>
<li>What is syntax?
</li>
<li>Learn more knowledge about emacs key-maps, and what's the difference between
  <code>global-set-key</code> and <code>remap</code>.
</li>
<li>Learn more knowledge about emacs syntax-table, functions like
  <code>modify-syntax-entry</code>, etc.
</li>
<li>What <code>enable-recursive-minibuffers</code> means to us?
</li>
<li>How to do asynchronous programming in emacs lisp?
</li>
<li>Make <code>ielm</code> as a real elisp <code>REPL</code>?
</li>
</ul>


</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">Common Lisp</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li>Integrate <a href="http://www.foldr.org/~michaelw/emacs/redshank/">redshank</a>?
</li>
</ul>


</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">Scheme</h3>
<div class="outline-text-3" id="text-7-3">

<ul>
<li>Write a package "ac-geisure", just like ac-slime.
</li>
</ul>


</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">Clojure</h3>
<div class="outline-text-3" id="text-7-4">

<ul>
<li>The boot up speed of JVM is too slow, so we may need to refer to
  <a href="http://icylisper.github.io/jark/">http://icylisper.github.io/jark/</a>.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="https://github.com/swank-js/swank-js">swank-js</a>, <a href="http://common-lisp.net/~crhodes/swankr/">swankr</a>
</p>


</div>
</div>
</div>

</div>
</div>
</div>

</body>
</html>
